Repository: CofficLab/GitOK
Catalog: Packages/PluginGitRepositoryWatch/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Broadcast events
zh_hans: 广播事件
zh_hk: 廣播事件

source: Changes are broadcast per dimension so each view refreshes precisely.
zh_hans: 按维度广播变化，各视图精确刷新。
zh_hk: 依維度廣播變化，各檢視精確重新整理。

source: Commit list, branch status, and workspace views refresh on demand.
zh_hans: 提交列表、分支状态与工作区视图按需刷新。
zh_hk: 提交列表、分支狀態與工作區檢視按需重新整理。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Event Broadcast
zh_hans: 事件广播
zh_hk: 事件廣播

source: External Awareness
zh_hans: 感知外部改动
zh_hk: 感知外部變更

source: External changes
zh_hans: 外部改动
zh_hk: 外部變更

source: FSEventStream reports every change inside .git.
zh_hans: FSEventStream 报告 .git 内的每一处变化。
zh_hk: FSEventStream 報告 .git 內的每一處變化。

source: Follow the project
zh_hans: 跟随项目
zh_hk: 跟隨專案

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Listen to the disk
zh_hans: 聆听磁盘
zh_hk: 聆聽磁碟

source: Live
zh_hans: 实时
zh_hk: 實時

source: Monitors the real .git directory with file system events, not polling.
zh_hans: 用文件系统事件监听真正的 .git 目录，而非轮询。
zh_hk: 用檔案系統事件監聽真正的 .git 目錄，而非輪詢。

source: See repository changes the moment they happen — even from outside GitOK.
zh_hans: 仓库一有变化立即可见——即使来自 GitOK 之外。
zh_hk: 儲存庫一有變化立即可見——即使來自 GitOK 之外。

source: Terminal stash, checkout, or third-party tools instantly refresh the UI.
zh_hans: 终端的 stash、checkout 或第三方工具改动会立即刷新界面。
zh_hk: 終端的 stash、checkout 或第三方工具變更會立即重新整理介面。

source: The watcher targets the current project's .git directory.
zh_hans: 监听器以当前项目的 .git 目录为目标。
zh_hk: 監聽器以目前專案的 .git 目錄為目標。

source: True File Watching
zh_hans: 真实文件监听
zh_hk: 真實檔案監聽

source: monitoring
zh_hans: 监听
zh_hk: 監聽

source: watch target
zh_hans: 监听目标
zh_hk: 監聽目標
